In [2]:
import pandas as pd
import numpy as np
from numpy.random import randn

In [3]:
np.random.seed(101) # set a random seed to get always same from random

In [9]:

df = pd.DataFrame(data=randn(5, 4), index=['A', 'B', 'C', 'D', 'E'], columns=['W', 'X', 'Y', 'Z'])
df
# every columns are just pd.Series
# dataframe = bunch of Series that share an index

          W         X         Y         Z
A -1.467514 -0.494095 -0.162535  0.485809
B  0.392489  0.221491 -0.855196  1.541990
C  0.666319 -0.538235 -0.568581  1.407338
D  0.641806 -0.905100 -0.391157  1.028293
E -1.972605 -0.866885  0.720788 -1.223082

In [11]:
df['W']
# thats a series

A   -1.467514
B    0.392489
C    0.666319
D    0.641806
E   -1.972605
Name: W, dtype: float64

In [12]:
type(df['W'])

pandas.core.series.Series

In [13]:
type(df)

pandas.core.frame.DataFrame

In [15]:
df[['W', 'Z']]
# thats a dataframe because multiple cols

          W         Z
A -1.467514  0.485809
B  0.392489  1.541990
C  0.666319  1.407338
D  0.641806  1.028293
E -1.972605 -1.223082

In [16]:
type(df[['W', 'Z']])

pandas.core.frame.DataFrame

Adding columns

In [19]:
df['new'] = df['W'] + df['Y']
df

          W         X         Y         Z       new
A -1.467514 -0.494095 -0.162535  0.485809 -1.630049
B  0.392489  0.221491 -0.855196  1.541990 -0.462707
C  0.666319 -0.538235 -0.568581  1.407338  0.097738
D  0.641806 -0.905100 -0.391157  1.028293  0.250649
E -1.972605 -0.866885  0.720788 -1.223082 -1.251818

Drop Columns

In [21]:
df.drop('new')
# wont work because axis=0 is default which are rows

KeyError: "['new'] not found in axis"

In [22]:
df.drop('new', axis=1)

          W         X         Y         Z
A -1.467514 -0.494095 -0.162535  0.485809
B  0.392489  0.221491 -0.855196  1.541990
C  0.666319 -0.538235 -0.568581  1.407338
D  0.641806 -0.905100 -0.391157  1.028293
E -1.972605 -0.866885  0.720788 -1.223082

Inplace

In [24]:
df
# 'new' is still here

          W         X         Y         Z       new
A -1.467514 -0.494095 -0.162535  0.485809 -1.630049
B  0.392489  0.221491 -0.855196  1.541990 -0.462707
C  0.666319 -0.538235 -0.568581  1.407338  0.097738
D  0.641806 -0.905100 -0.391157  1.028293  0.250649
E -1.972605 -0.866885  0.720788 -1.223082 -1.251818

In [25]:
df.drop('new', axis=1, inplace=True)

In [26]:
df

          W         X         Y         Z
A -1.467514 -0.494095 -0.162535  0.485809
B  0.392489  0.221491 -0.855196  1.541990
C  0.666319 -0.538235 -0.568581  1.407338
D  0.641806 -0.905100 -0.391157  1.028293
E -1.972605 -0.866885  0.720788 -1.223082

Drop Rows

In [27]:
df.drop('E', axis=0)

          W         X         Y         Z
A -1.467514 -0.494095 -0.162535  0.485809
B  0.392489  0.221491 -0.855196  1.541990
C  0.666319 -0.538235 -0.568581  1.407338
D  0.641806 -0.905100 -0.391157  1.028293

In [28]:
df.shape

(5, 4)

Selecting rows

In [30]:
df.loc['A']
# takes label as parameter

W   -1.467514
X   -0.494095
Y   -0.162535
Z    0.485809
Name: A, dtype: float64

In [32]:
df.iloc[0]
# takes index of the row, even if index is not num

W   -1.467514
X   -0.494095
Y   -0.162535
Z    0.485809
Name: A, dtype: float64

Selecting subsets

In [33]:
df.loc['B', 'Y']
# row B, column Y

-0.8551960407780934

In [34]:
df.loc[['A', 'B'], ['W', 'Y']]

          W         Y
A -1.467514 -0.162535
B  0.392489 -0.855196

# Part 2

In [38]:
df

          W         X         Y         Z
A -1.467514 -0.494095 -0.162535  0.485809
B  0.392489  0.221491 -0.855196  1.541990
C  0.666319 -0.538235 -0.568581  1.407338
D  0.641806 -0.905100 -0.391157  1.028293
E -1.972605 -0.866885  0.720788 -1.223082

Conditional selection

In [35]:
df > 0

       W      X      Y      Z
A  False  False  False   True
B   True   True  False   True
C   True  False  False   True
D   True  False  False   True
E  False  False   True  False

In [36]:
df[df > 0]

          W         X         Y         Z
A       NaN       NaN       NaN  0.485809
B  0.392489  0.221491       NaN  1.541990
C  0.666319       NaN       NaN  1.407338
D  0.641806       NaN       NaN  1.028293
E       NaN       NaN  0.720788       NaN

In [40]:
df['W']>0
# returns Series

A    False
B     True
C     True
D     True
E    False
Name: W, dtype: bool

In [43]:
df[df['W']>0]
# only returns True rows
# returns dataframe

          W         X         Y         Z
B  0.392489  0.221491 -0.855196  1.541990
C  0.666319 -0.538235 -0.568581  1.407338
D  0.641806 -0.905100 -0.391157  1.028293

In [44]:
result_df = df[df['W']<0]

In [45]:
result_df['X']

A   -0.494095
E   -0.866885
Name: X, dtype: float64

In [49]:
df[df['W']<0]['X']

A   -0.494095
E   -0.866885
Name: X, dtype: float64

In [51]:
df[df['W']<0][['Y', 'X']]
# row W < 0
# cols only Y, X

          Y         X
A -0.162535 -0.494095
E  0.720788 -0.866885

Multiple Conditions

In [57]:
df

          W         X         Y         Z
A -1.467514 -0.494095 -0.162535  0.485809
B  0.392489  0.221491 -0.855196  1.541990
C  0.666319 -0.538235 -0.568581  1.407338
D  0.641806 -0.905100 -0.391157  1.028293
E -1.972605 -0.866885  0.720788 -1.223082

In [52]:
df[(df['W'] > 0) and df['Y'] > 1]
# error, because python 'and' operator can not deal with mutliple instances of bool values

ValueError: The truth value of a Series is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().

In [59]:
df[(df['W'] < 0) & (df['Y'] < 1)]

          W         X         Y         Z
A -1.467514 -0.494095 -0.162535  0.485809
E -1.972605 -0.866885  0.720788 -1.223082

Reseting index

In [60]:
df

          W         X         Y         Z
A -1.467514 -0.494095 -0.162535  0.485809
B  0.392489  0.221491 -0.855196  1.541990
C  0.666319 -0.538235 -0.568581  1.407338
D  0.641806 -0.905100 -0.391157  1.028293
E -1.972605 -0.866885  0.720788 -1.223082

In [62]:
df.reset_index()
# old index will reset to new column
# not inplace

  index         W         X         Y         Z
0     A -1.467514 -0.494095 -0.162535  0.485809
1     B  0.392489  0.221491 -0.855196  1.541990
2     C  0.666319 -0.538235 -0.568581  1.407338
3     D  0.641806 -0.905100 -0.391157  1.028293
4     E -1.972605 -0.866885  0.720788 -1.223082

In [65]:
new_index = 'CA NY WY OR CO'.split()
new_index

['CA', 'NY', 'WY', 'OR', 'CO']

In [68]:
df['States'] = new_index
df

          W         X         Y         Z States
A -1.467514 -0.494095 -0.162535  0.485809     CA
B  0.392489  0.221491 -0.855196  1.541990     NY
C  0.666319 -0.538235 -0.568581  1.407338     WY
D  0.641806 -0.905100 -0.391157  1.028293     OR
E -1.972605 -0.866885  0.720788 -1.223082     CO

In [72]:
df.set_index('States')

               W         X         Y         Z
States
CA     -1.467514 -0.494095 -0.162535  0.485809
NY      0.392489  0.221491 -0.855196  1.541990
WY      0.666319 -0.538235 -0.568581  1.407338
OR      0.641806 -0.905100 -0.391157  1.028293
CO     -1.972605 -0.866885  0.720788 -1.223082

# Part 3